# -*- coding: utf-8 -*-
import random

from data_loader import DataLoader
from langchain.schema import Document

from embedding import EmbeddingModel
from evaluate import Evaluator
from generation import RAGChain


if __name__ == "__main__":
    base_dir = 'data'
    data_loader = DataLoader(base_dir)
    data = data_loader.load_data()

    print(f"Number of documents loaded: {len(data)}")

    samples = random.sample(data, 25000)
    documents = [Document(page_content=text["content"]) for text in samples]
    print(documents[0])

    google_api_key = "AIzaSyAe8x5EZLyLG6IhTo85hp10558Fh22xv1k"
    rag_chain = RAGChain(documents, google_api_key)

    evaluation_data = [
        {"question": "ما هو اسم وزير التعليم اللبناني؟", "correct_answer": "اسم وزير التعليم اللبناني هو عباس الحلبي."},
        {"question": "ما هي العاصمة الفرنسية؟", "correct_answer": "العاصمة الفرنسية هي باريس."},
        {"question": "من هو المدرب الجديد لنادي بلد الوليد؟", "correct_answer": "خافيير كليمتني"},
        {"question": "ما هي المباراة التي ألهب فيها زين الدين زيدان حماسة الجماهير الجزائرية؟",
         "correct_answer": "مباراة ودية ضد منتخب الجزائر في كرة الصالات."},
        {"question": "ماذا نصح جاك سيلي واين روني بخصوص الانتقال إلى الدوري الصيني؟",
         "correct_answer": "نصح سيلي روني بدراسة الوضع جيداً وزيارة الصين قبل الانتقال، واختار نادياً في مدينة متحضرة مثل شنغهاي أو بكين."},
        {"question": "ماذا يبحث وزير الخارجية الكوري الجنوبي خلال زيارته لليابان؟",
         "correct_answer": "يبحث إصلاح العلاقات المتوترة مع نظيره الياباني فوميو كيشيدا."},
        {"question": "لماذا أوقفت الشرطة المغربية شخصاً في الدار البيضاء؟",
         "correct_answer": "للاشتباه في علاقته باغتيال البرلماني عبد اللطيف مرداس."},
        {"question": "ماذا قال وزير الخارجية الإيراني عن مفاوضات موسكو في يونيو؟",
         "correct_answer": "أكد أنها ستكون شاقة لكن إيران تأمل أن تكون مثمرة."},
        {"question": "ما هو الهدف من افتتاح العيادة الطبية الجديدة في مجمع دبي الصناعي؟",
         "correct_answer": "تلبية احتياجات أكثر من 42 ألف عامل وتوفير الرعاية الصحية المتكاملة."},
        {"question": "كم عدد الأطفال الذين حققت مؤسسة تحقيق أمنية أمنياتهم هذا العام؟",
         "correct_answer": "حوالي 230 طفلًا."},
        {"question": "ما هو الهدف من مبادرة أمة اقرأ بدأت تقرأ التي نظمتها منطقة رأس الخيمة الطبية؟",
         "correct_answer": "الهدف هو تحفيز المجتمع على القراءة وتغذية العقول بالمعرفة والثقافة، تحقيقًا لرؤية قيادة الدولة في بناء جيل مبتكر."},
        {"question": "ما هو الاستثمار الذي أعلنت عنه شركة ميلينيوم للأسهم الخاصة مؤخراً؟",
         "correct_answer": "استثمرت ميلينيوم للأسهم الخاصة في شبكات تورين، المجهز العالمي لحلول شبكة إثيرنيت/آي . بي أوبتمايزد، لتعزيز مكانتها في الأسواق العالمية."},
        {"question": "ما هي أبرز نتائج تداول سوق أبوظبي للأوراق المالية أمس؟",
         "correct_answer": "ارتفع المؤشر العام لسوق أبوظبي بنسبة 0.75% إلى 2747 نقطة. تداولت السوق أسهماً بقيمة 169.1 مليون درهم، مع ارتفاع أسعار أسهم 20 شركة وانخفاض أسعار أسهم 8 شركات. تصدرت شركة أبوظبي الوطنية للتكافل قائمة الشركات الأكثر ارتفاعاً بزيادة 10%."},
        {"question": "ما هي أبرز نتائج تداول سوق الإمارات المالي في الجلسة الأخيرة؟",
         "correct_answer": "انخفض مؤشر سوق الإمارات المالي بنسبة 0.93% إلى 4936.30 نقطة، مع انخفاض القيمة السوقية بمقدار 7.52 مليار درهم إلى 800.15 مليار درهم. تم تداول حوالي 359.88 مليون سهم بقيمة 0.68 مليار درهم. تصدرت شركة إعمار العقارية النشاط بقيمة تداول 80.11 مليون درهم، بينما سجل سهم الجرافات البحرية أكبر انخفاض بنسبة 9.09%."},
        {"question": "ما هو الموضوع الرئيسي لملف مجلة تراث في عدد ديسمبر الجاري؟",
         "correct_answer": "ملف ديسمبر لمجلة تراث يركز على احتفالات اليوم الوطني الثاني والأربعين لدولة الإمارات تحت عنوان 42 عاماً من الإنجازات. يتضمن الملف دراسات توثيقية عن الآباء المؤسسين، تاريخ أعلام الساحل المتصالح، وسيرة محمد بن حبروش السويدي، إضافة إلى قصائد وطنية وشهادات حول النشيد الوطني للإمارات."},
        {
            "question": "ماذا قدم الأديب العراقي شهاب الكعبي في الأمسية القصصية التي نظّمها منتدى السرد في اتحاد كتّاب وأدباء الإمارات؟",
            "correct_answer": "قدم شهاب الكعبي في الأمسية القصصية قراءات من أعماله التي تشمل مجموعات قصصية وروايات، حيث تميزت قصصه بتركيزها على الحبكة الكلاسيكية واستخدام الاستعارات الفنية."},
        {"question": "متى ستبدأ المنافسات في موسم مسابقة أمير الشعراء الخامس وما هي خطوات اختيار الشعراء؟",
         "correct_answer": "ستبدأ المنافسات في مطلع مايو المقبل، بعد أن تختار لجنة التحكيم القائمة النهائية من بين 300 مترشح عبر مقابلات وتقييمات إضافية."},
        {
            "question": "ما هي أبرز المبادرات التي تم الإعلان عنها خلال معرض جيتكس 2016 من قبل هيئة دبي للطيران المدني ومؤسسة مطارات دبي؟",
            "correct_answer": "أعلنت هيئة دبي للطيران المدني عن تدشين نظام إلكتروني لإصدار تصاريح نقل البضائع الخطرة، بينما كشفت مؤسسة مطارات دبي عن شراكة مع شركة هواوي لتصميم وبناء مركز بيانات معياري مرخص من المستوى الثالث في مطار دبي الدولي."},
        {"question": "ما هي أبرز ميزات إصدار 2015 من برنامج أوتوكاد الذي أعلنته أومنيكس إنترناشيونال؟",
         "correct_answer": "إصدار 2015 من أوتوكاد يقدم واجهة مستخدم أكثر تطوراً مع تصميم أغمق وأحدث، ويشمل ميزات مثل القدرة على فتح الرسومات الجديدة بسرعة، والتصميم بمظهر عصري، وتحسينات في تحرير النصوص وصور الرسوميات. كما يتوفر الآن بنظام الاشتراك دفع الاستحقاقات أولاً بأول."},
        {"question": "متى وأين ستعقد دورة معرضي جلف باك وجلف برنت المقبلة، وما هو هدفهما الرئيسي؟",
         "correct_answer": "ستعقد دورة معرضي جلف باك وجلف برنت من 6 إلى 9 أبريل 2009 في مركز معارض مطار دبي الدولي. يهدف المعرضان إلى تلبية احتياجات صناعات الطباعة والتغليف في الشرق الأوسط والعالم."},
    ]

    evaluator = Evaluator(EmbeddingModel())
    accuracy = evaluator.evaluate(evaluation_data, rag_chain)
    print(f"Accuracy: {accuracy}%")
