# -*- coding: utf-8 -*-

from data_loader import DataLoader
from langchain.schema import Document

from embedding import EmbeddingModel
from evaluate import Evaluator
from generation import RAGChain


if __name__ == "__main__":
    base_dir = 'data'
    data_loader = DataLoader(base_dir)
    data = data_loader.load_data()

    print(f"Number of documents loaded: {len(data)}")

    # enter your API
    google_api_key = ""
    documents = [Document(page_content=text["content"]) for text in data[:166]]
    rag_chain = RAGChain(documents, google_api_key)

    evaluation_data = [
        {"question": "ما هو المعرض الذي ستقيمه الفنانة ليتا كابيلوت في مطلع العام المقبل؟", "correct_answer": "ستقيم الفنانة ليتا كابيلوت معرضاً في مطلع العام المقبل في دبي يضم 35 لوحة تركز خلالها على الوجوه."},
        {"question": "ما هو اسم المعرض الذي ينظمه معهد الشارقة للفنون؟", "correct_answer": "المعرض يحمل عنوان باقة الفن."},
        {"question": "متى ولدت ليتا كابيلوت ومن تولى تربيتها؟", "correct_answer": "ولدت ليتا كابيلوت في العام 1961، وتولت تربيتها جدتها الغجرية حتى سن الثامنة، ثم تم تسليمها إلى أحد المياتم."},
        {"question": "ما هو البرنامج الذي أطلقته وزارة الثقافة وتنمية المعرفة لدعم المؤلفين الشباب؟", "correct_answer": "برنامج إعداد المؤلفين الشباب."},
        {"question": "ن الذين حاضروا في محاضرة أدب الطفل بين الشعر والقصة التي استضافها بيت الشعر في مصر؟",
         "correct_answer": " الشاعر أحمد فضل شبلول والقاص أحمد طوسون."},
        {"question": "ما هو محتوى كتاب مملكة وجدو بين الأسطورة والتاريخ؟",
         "correct_answer": "يحتوي الكتاب على نصوص إفريقية تتناول أسطورة وحركة إمبراطورية وجدو، وتمتد من غرب إفريقيا الساحلي إلى وسط الصحراء الكبرى، موضحاً تاريخ وحركية جماعة السوننكي."},
        {"question": "ما هي رواية يوسف زيدان الجديدة محال؟",
         "correct_answer": "محال هي رواية جديدة ليوسف زيدان تستلهم تجربة الاعتقال في معسكر غوانتانامو، وتتناول قصة شاب مصري يعمل بالإرشاد السياحي ويُعتقل في أفغانستان، وتظهر فيها شخصية أسامة بن لادن بشكل مختلف عن الشائع في الإعلام."},
        {"question": "لماذا أوقفت الشرطة المغربية شخصاً في الدار البيضاء؟",
         "correct_answer": "للاشتباه في علاقته باغتيال البرلماني عبد اللطيف مرداس."},
        {"question": "ما هو دور الكلمة في التاريخ الإنساني حسب النص؟",
         "correct_answer": "الكلمة كانت حامل الوعي الإنساني وأداة تطوره، سواء في التواصل والإبداع أو في الفلسفة والفن والعلم، وتلعب دورًا محوريًا بين فعل الخير وفعل الشر، رغم التحديات التي تواجهها مع انتشار الصورة الإلكترونية."},
        {"question": "ما هو دور دائرة الثقافة والإعلام في الشارقة في معرض بيروت الدولي للكتاب؟",
         "correct_answer": "تشارك دائرة الثقافة والإعلام في الشارقة في معرض بيروت الدولي للكتاب بجناح يعرض إصداراتها الجديدة لعام 2010، بما في ذلك القصة القصيرة والشعر والفنون والتراث والمسرح والثقافة العامة والدراسات النقدية وكتب الأطفال وكتب جائزة الشارقة للإبداع العربي ومجلة الرافد الثقافية، بالإضافة إلى مؤلفات حاكم الشارقة المترجمة إلى عدة لغات."},
        {"question": "ين أقامت مؤسسة عبد العزيز سعود البابطين الثقافية حفل توزيع جوائزها؟",
         "correct_answer": " أقامت مؤسسة عبد العزيز سعود البابطين الثقافية حفل توزيع جوائزها في جامعة قرطبة في إسبانيا."},
        {"question": "من فاز بالجائزة الأولى في جائزة عبد العزيز سعود البابطين العالمية في الدراسات التاريخية والثقافية في الأندلس؟",
         "correct_answer": "فازت بالجائزة الأولى الباحثة الدكتورة مارابيا أغيار أغيلار عن بحثها حول تدريس الرياضيات بمساعدة الآلات الفلكية وفقاً للقاضي المالكي عز الدين مسعود بن فرمجة."},
        {"question": "ا هو موضوع مشروع ليتا كابيلوت المهم الذي تسلط الضوء عليه؟",
         "correct_answer": "تسلط ليتا كابيلوت الضوء على المرض العقلي في مشروعها المهم الذي تسميه أم المآسي الإنسانية."},
        {"question": "كم عدد الشعراء الذين سيتنافسون في الحلقة الجديدة من برنامج شاعر المليون؟",
         "correct_answer": "سيتنافس ثمانية شعراء من دول عربية مختلفة."},
    ]

    evaluator = Evaluator(EmbeddingModel())
    accuracy = evaluator.evaluate(evaluation_data, rag_chain)
    print(f"Accuracy: {accuracy}%")
